Repository: yusufmolumo/group7_i18nandl10n
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: es, fr

source: Flask i18n Demo
es: Demo de i18n en Flask
fr: Démo i18n Flask

source: Home
es: Inicio
fr: Accueil

source: About
es: Acerca de
fr: À propos

source: Current language
es: Idioma actual
fr: Langue actuelle

source: Flask i18n and l10n Demo
es: Demo de i18n y l10n en Flask
fr: Démo i18n et l10n Flask

source: Welcome to the Flask i18n Demo
es: Bienvenido a la Demo de i18n en Flask
fr: Bienvenue à la Démo i18n Flask

source: This is a demonstration of internationalization and localization in Flask.
es: Esta es una demostración de internacionalización y localización en Flask.
fr: Ceci est une démonstration d'internationalisation et de localisation dans Flask.

source: Localization Examples
es: Ejemplos de Localización
fr: Exemples de Localisation

source: Date and Time Formatting
es: Formato de Fecha y Hora
fr: Formatage de Date et Heure

source: Current time
es: Hora actual
fr: Heure actuelle

source: Number Formatting
es: Formato de Números
fr: Formatage de Nombres

source: Formatted number
es: Número formateado
fr: Nombre formaté

source: Change the language using the links in the header to see how the content changes.
es: Cambia el idioma usando los enlaces en el encabezado para ver cómo cambia el contenido.
fr: Changez la langue en utilisant les liens dans l'en-tête pour voir comment le contenu change.

source: About This Application
es: Acerca de Esta Aplicación
fr: À propos de Cette Application

source: This is a demonstration application showing how to implement internationalization (i18n) and localization (l10n) in a Flask application.
es: Esta es una aplicación de demostración que muestra cómo implementar la internacionalización (i18n) y la localización (l10n) en una aplicación Flask.
fr: Ceci est une application de démonstration montrant comment implémenter l'internationalisation (i18n) et la localisation (l10n) dans une application Flask.

source: Features
es: Características
fr: Fonctionnalités

source: Multiple language support (English, Spanish, French)
es: Soporte para múltiples idiomas (Inglés, Español, Francés)
fr: Support de plusieurs langues (Anglais, Espagnol, Français)

source: Language detection based on browser settings
es: Detección de idioma basada en la configuración del navegador
fr: Détection de langue basée sur les paramètres du navigateur

source: Manual language selection
es: Selección manual de idioma
fr: Sélection manuelle de langue

source: Localized date/time formatting
es: Formato de fecha/hora localizado
fr: Formatage de date/heure localisé

source: Localized number formatting
es: Formato de números localizado
fr: Formatage de nombres localisé

source: Technologies Used
es: Tecnologías Utilizadas
fr: Technologies Utilisées
